Практическое занятие «Введение в UNIX», часть C

Задание должно выполняться на сервере HOST.

Правила оформления ответов описаны ранее.

Шаг 26. Для компиляции программ на языке Си используется команда gcc, которая имеет вид

gcc OPTIONS-AND-FILES.
Например,

gcc prog.c -Wall -Werror -std=gnu11 -g -o prog
запустит компиляцию программы prog.c. В случае отсутствия ошибок будет создан исполняемый файл prog.

Вопрос 29. В домашнем каталоге создайте каталог newtask3. Сделайте этот каталог текущим. В этом каталоге с помощью команды cat создайте файл aplusb.c следующего содержания:

void main()
{
int a, b, c;
scanf("%d%d", a, &b);
c == a + b;
printf("%d\n", c);
}
Запустите компиляцию файла командой

gcc -Wall -Werror -std=gnu11 -O2 aplusb.c -o aplusb
Какие сообщения об ошибках будут напечатаны командой gcc?

Вопрос 30. Исправьте ошибки. Добейтесь, чтобы компиляция файла проходила без ошибок. Какую информацию печатает команда ls -l о файле aplusb?

Шаг 27. Для запуска программы из текущего каталога необходимо использовать явную запись текущего каталога '.', так как текущий каталог не находится в списке каталогов в переменной окружения PATH. Например,

./aplusb
Вопрос 31. Запустите программу aplusb из текущего каталога. В качестве первого числа введите ваш идентификатор пользователя, в качестве второго числа введите размер файла aplusb. Какой будет напечатан результат?

Шаг 28. В текущем каталоге создайте текстовый файл 001.dat, содержащий два целых числа. Первое число было напечатано командой aplusb в вопросе 26. Второе число — размер файла /etc/passwd. Не забудьте разделить их пробелом или переводом строки.

Вопрос 32. Какая командная строка необходима для запуска программы aplusb, перенаправления ей на стандартный ввод файла 001.dat и перенаправления ее стандартного вывода в файл 001.res?

Вопрос 33. Выполните эту команду. С помощью команды cat выведите содержимое файла 001.res.

Шаг 29. Для измерения времени работы программы используетсякоманда time. Например,

time ./aplusb < 001.dat
Время работы программы выводится в строке ”User”.

Вопрос 34. Чему равно это время (User)?

Шаг 30. В программу вставьте цикл задержки вида

for (int i = 0; i < N; ++i) {}
где константу N подберите таким образом, чтобы время работы программы (User) попало в промежуток от 1.000 до 1.100 секунды. При компиляции программы не используйте опции оптимизации (-O2)!

Вопрос 35. Чему равно значение N?

Шаг 31. Для перенаправления стандартного выходного потока одного процесса на стандартный входной поток другого процесса в командном интерпретаторе используется символ | (вертикальная черта).

Вопрос 36. Напишите и объясните, что выведет на экран команда:

ps -Al | grep sh
Шаг 32. Вопросы повышенной сложности

Вопрос 37. Что выводит ulimit -c, что делает ulimit -c 0?

Вопрос 38. Напишите программу, вызывающую segmentation fault, получите core dump-файл. Ответом на вопрос будет являться вывод

readelf -S <имя файла>
Вопрос 39. Напишите команду для командного интерпретатора, выводящую на экран полный листинг (результат работы ls -l) для 5 файлов с самыми маленькими длинами из каталога /etc, в именах которых содержится строка “.conf”, отсортированных по возрастанию размера файлов.

Вопрос 40. Напишите команду для командного интерпретатора, подсчитывающую число слов в файле /usr/share/dict/words , которые не содержат ни одну из латинских букв: a, e, i, o или u.
